# # Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр.
# # Пример:
# # - 6782 -> 23
# # - 0,56 -> 11

# number = input("Введите число: ")
# amount_digits = len(number)
# summ = 0
# for i in range(amount_digits):
# 	if number[i] == "," or number[i] == ".":
# 		i+=1
# 	else:
# 		summ += int(number[i])
# print(summ)

# ---------------------------------------------------

# Напишите программу, которая принимает на вход число N и выдает набор произведений чисел от 1 до N.
# Пример:
# - пусть N = 4, тогда [ 1, 2, 6, 24 ] (1, 1*2, 1*2*3, 1*2*3*4)

# n = int(input("Введите число N: "))
# list = []
# ind = 1
# for i in range(1, n+1):
# 	ind*= i
# 	list.append(ind)
# print(list)

# ---------------------------------------------------

# Задайте список из n чисел последовательности $(1+\frac 1 n)^n$ и выведите на экран их сумму.
# Пример:
# Для N = 4, тогда {1:2, 2:2,25, 3:2,27, 4:2,44}
# Сумма: 9,06

# n = int(input("Введите N: "))
# summ = 0
# for i in range(1, n+1):
#     summ = summ + (1 + (1/i)) ** i
#     print(f'{i}:{(1 + (1/i)) ** i}')
# print(summ)

# ---------------------------------------------------

# Даны два массива:
# [1, 2, 3, 2, 0] и [5, 1, 2, 7, 3, 2]
# Надо вернуть их пересечение
# [1, 2, 2, 3]
# (порядок не важен)

# list_1 = [1, 2, 3, 2, 0]
# list_2 = [5, 1, 2, 7, 3, 2]
# list_common_index = []
# for i in range(len(list_1)):
# 	for j in range(len(list_2)):
# 		if list_1[i] == list_2[j]:
# 			list_common_index.append(list_1[i])
# 			break
# print(list_common_index)