# Задайте список из нескольких чисел.
# Напишите программу, которая найдёт сумму элементов списка, стоящих на нечётной позиции.
# Пример:
# - [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12

# from random import *

# list_1 = []
# for _ in range(5):
#     list_1.append(randint(1, 9))
# print(list_1)

# summ = 0
# for i in range(1, len(list_1), 2):
#     summ = summ + list_1[i]

# print('Сумма элементов на нечетных позициях: ', summ)

# -----------------------------------------------------------------------------------------------

# Напишите программу, которая найдёт произведение пар чисел списка.
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример:
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

# from random import *

# list_1 = []
# for _ in range(7):
#     list_1.append(randint(1, 9))
# print(list_1)

# list_2 = []
# j = len(list_1)-1

# for i in range(len(list_1)):
#     while i <= len(list_1)/2 and j >= len(list_1)/2:
#         list_2.append(list_1[i] * list_1[j])
#         i += 1
#         j -= 1
#         if i==j:
#             list_2.append(list_1[i] * list_1[j])

# print(list_2)

# -----------------------------------------------------------------

# Задайте список из вещественных чисел. 
# Напишите программу, которая найдёт разницу между максимальным и минимальным значением дробной части элементов.
# Пример:
# - [1.1, 1.2, 3.1, 5, 10.01] => 0.19

# list_1 = [1.1, 1.2, 3.1, 5, 10.01]
# min = 0
# max = 0

# list_2 = []

# for i in range(len(list_1)):
#     list_2.append(list_1[i] - int(list_1[i]))
#     if(list_2[i] == 0):
#         continue
#     if(list_2[i] > max):
#         max = list_2[i]
#     if(list_2[i] < min):
#         min = list_2[i]
# print(list_2)
# print(max - min)

# -------------------------------------------------------------------

# Напишите программу, которая будет преобразовывать десятичное число в двоичное.
# Пример:
# - 45 -> 101101
# - 3 -> 11
# - 2 -> 10

# number_10 = int(input("Введите число: "))
# number_2 = " "
# while number_10 != 0:
# 	number_2 = str(number_10 % 2) + number_2
# 	number_10 //=2
# print(number_2)